nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments39.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments39.devId   = 212;
resourceAssignments39.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_UHCHAN' ;
resourceAssignments39.subtypeid  =  16;
resourceAssignments39.resourcerangestart =  undefined;
resourceAssignments39.resourcecount = undefined;






resourceAssignments40.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments40.devId   = 213;
resourceAssignments40.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments40.subtypeid  =  0;
resourceAssignments40.resourcerangestart =  undefined;
resourceAssignments40.resourcecount = undefined;






resourceAssignments41.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments41.devId   = 233;
resourceAssignments41.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments41.subtypeid  =  10;
resourceAssignments41.resourcerangestart =  undefined;
resourceAssignments41.resourcecount = undefined;






resourceAssignments42.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments42.devId   = 233;
resourceAssignments42.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments42.subtypeid  =  13;
resourceAssignments42.resourcerangestart =  undefined;
resourceAssignments42.resourcecount = undefined;






resourceAssignments43.devname  = 'J721E_DEV_MCU_NAVSS0_PROXY_0' ;
resourceAssignments43.devId   = 234;
resourceAssignments43.subtype   = 'RESASG_SUBTYPE_PROXY_PROXIES' ;
resourceAssignments43.subtypeid  =  0;
resourceAssignments43.resourcerangestart =  undefined;
resourceAssignments43.resourcecount = undefined;






resourceAssignments44.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments44.devId   = 235;
resourceAssignments44.subtype   = 'RESASG_SUBTYPE_RA_ERROR_OES' ;
resourceAssignments44.subtypeid  =  0;
resourceAssignments44.resourcerangestart =  undefined;
resourceAssignments44.resourcecount = undefined;






resourceAssignments45.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments45.devId   = 235;
resourceAssignments45.subtype   = 'RESASG_SUBTYPE_RA_GP' ;
resourceAssignments45.subtypeid  =  1;
resourceAssignments45.resourcerangestart =  undefined;
resourceAssignments45.resourcecount = undefined;






resourceAssignments46.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments46.devId   = 235;
resourceAssignments46.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments46.subtypeid  =  2;
resourceAssignments46.resourcerangestart =  undefined;
resourceAssignments46.resourcecount = undefined;






resourceAssignments47.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments47.devId   = 235;
resourceAssignments47.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments47.subtypeid  =  3;
resourceAssignments47.resourcerangestart =  undefined;
resourceAssignments47.resourcecount = undefined;






resourceAssignments48.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments48.devId   = 235;
resourceAssignments48.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments48.subtypeid  =  5;
resourceAssignments48.resourcerangestart =  undefined;
resourceAssignments48.resourcecount = undefined;






resourceAssignments49.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments49.devId   = 235;
resourceAssignments49.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_H' ;
resourceAssignments49.subtypeid  =  7;
resourceAssignments49.resourcerangestart =  undefined;
resourceAssignments49.resourcecount = undefined;






resourceAssignments50.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments50.devId   = 235;
resourceAssignments50.subtype   = 'RESASG_SUBTYPE_RA_VIRTID' ;
resourceAssignments50.subtypeid  =  10;
resourceAssignments50.resourcerangestart =  undefined;
resourceAssignments50.resourcecount = undefined;






resourceAssignments51.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments51.devId   = 235;
resourceAssignments51.subtype   = 'RESASG_SUBTYPE_RA_MONITORS' ;
resourceAssignments51.subtypeid  =  11;
resourceAssignments51.resourcerangestart =  undefined;
resourceAssignments51.resourcecount = undefined;






resourceAssignments52.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments52.devId   = 236;
resourceAssignments52.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_FLOW_COMMON' ;
resourceAssignments52.subtypeid  =  0;
resourceAssignments52.resourcerangestart =  undefined;
resourceAssignments52.resourcecount = undefined;






resourceAssignments53.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments53.devId   = 236;
resourceAssignments53.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments53.subtypeid  =  1;
resourceAssignments53.resourcerangestart =  undefined;
resourceAssignments53.resourcecount = undefined;






resourceAssignments54.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments54.devId   = 236;
resourceAssignments54.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments54.subtypeid  =  2;
resourceAssignments54.resourcerangestart =  undefined;
resourceAssignments54.resourcecount = undefined;






resourceAssignments55.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments55.devId   = 236;
resourceAssignments55.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments55.subtypeid  =  3;
resourceAssignments55.resourcerangestart =  undefined;
resourceAssignments55.resourcecount = undefined;






resourceAssignments56.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments56.devId   = 236;
resourceAssignments56.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments56.subtypeid  =  10;
resourceAssignments56.resourcerangestart =  undefined;
resourceAssignments56.resourcecount = undefined;






resourceAssignments57.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments57.devId   = 236;
resourceAssignments57.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments57.subtypeid  =  11;
resourceAssignments57.resourcerangestart =  undefined;
resourceAssignments57.resourcecount = undefined;






resourceAssignments58.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments58.devId   = 236;
resourceAssignments58.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments58.subtypeid  =  13;
resourceAssignments58.resourcerangestart =  undefined;
resourceAssignments58.resourcecount = undefined;






resourceAssignments59.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments59.devId   = 236;
resourceAssignments59.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments59.subtypeid  =  15;
resourceAssignments59.resourcerangestart =  undefined;
resourceAssignments59.resourcecount = undefined;






resourceAssignments60.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments60.devId   = 237;
resourceAssignments60.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments60.subtypeid  =  0;
resourceAssignments60.resourcerangestart =  undefined;
resourceAssignments60.resourcecount = undefined;






